modifie documentation project
